In [1]:
import pandas as pd

In [3]:
df1 = pd.read_csv('salaries_by_college_major.csv')
clear_df = df1.dropna()
clear_df.head(5)

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,41600.0,76800.0,50600.0,136000.0,Business

In [5]:
clear_df.describe()

,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
count,50.000000,50.00000,50.000000,50.000000
mean,44310.000000,74786.00000,43408.000000,142766.000000
std,9360.866217,16088.40386,12000.779567,27851.249267
min,34000.000000,52000.00000,26700.000000,96400.000000
25%,37050.000000,60825.00000,34825.000000,124250.000000
50%,40850.000000,72000.00000,39400.000000,145500.000000
75%,49875.000000,88750.00000,49850.000000,161750.000000
max,74300.000000,107000.00000,71900.000000,210000.000000

In [7]:
clear_df['Starting Median Salary'].mean()

44310.0

In [9]:
clear_df['Starting Median Salary'].median()

40850.0

In [11]:
clear_df['Starting Median Salary'].mode()

0    35900.0
Name: Starting Median Salary, dtype: float64

In [17]:
clear_df['Starting Median Salary'].value_counts().head(3)

Starting Median Salary
35900.0    3
42600.0    2
57700.0    2
Name: count, dtype: int64

In [19]:
# If we want to get count in percentage, then add attribute normalize=True
clear_df['Starting Median Salary'].value_counts(normalize=True).head(3)

Starting Median Salary
35900.0    0.06
42600.0    0.04
57700.0    0.04
Name: proportion, dtype: float64